In [27]:
import pandas as pd

In [39]:
dataset =pd.read_csv(r"E:\tops\Data science\practical\loan.csv")
dataset.head(3)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

In [49]:
dataset.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [48]:
dataset["Gender"]=dataset["Gender"].fillna(dataset["Gender"].mode()[0])

# one hot encoding dummy variables through

In [10]:
en_data=dataset[["Gender","Married"]]
en_data.head(3)

  Gender Married
0   Male      No
1   Male     Yes
2   Male     Yes

In [12]:
en_data=pd.get_dummies(en_data)

In [17]:
en_data=en_data.astype({col: int for col in en_data.select_dtypes(include="bool").columns})

In [21]:
en_data=en_data.drop(["Gender_Female","Married_No"],axis=1)

In [22]:
en_data.head()

   Gender_Male  Married_Yes
0            1            0
1            1            1
2            1            1
3            1            1
4            1            0

In [23]:
dataset[["Gender","Married"]]=en_data

In [25]:
dataset.rename(columns={"Gender": "Gender_Male"}, inplace=True)
dataset.rename(columns={"Married": "Married_Yes"}, inplace=True)

In [26]:
dataset.head(3)

,Loan_ID,Gender_Male,Married_Yes,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,1,0,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,1,1,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,1,1,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y

# one hot encoding scikit learn

In [29]:
from sklearn.preprocessing import OneHotEncoder

In [50]:
ohe=OneHotEncoder(drop="first")
ar=ohe.fit_transform(dataset[["Gender","Married"]]).toarray()

In [51]:
ar

array([[1., 0.],
       [1., 1.],
       [1., 1.],
       ...,
       [1., 1.],
       [1., 1.],
       [0., 0.]])

In [52]:
dataset[["Gender", "Married"]] = pd.DataFrame(ar, columns=["Gender", "Married"],index=dataset.index)

In [54]:
dataset.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,1.0,0.0,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,1.0,1.0,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,1.0,1.0,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,1.0,1.0,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,1.0,0.0,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y